music_app/app/models/user.rb

  def self.find_by_credentials(email,password)
    user = User.where(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "elena.churilov@gmail.com"], ["LIMIT", 1]]